In [189]:
import pandas as pd

# 1. Series (1D)

In [190]:
series=pd.Series([1,2,23,4],index=["a",'b','c','d'])
series2=pd.Series([1,2,3,4])

In [191]:
series

a     1
b     2
c    23
d     4
dtype: int64

In [192]:
series2

0    1
1    2
2    3
3    4
dtype: int64

In [193]:
print(series['a'])

1

# 2. DataFrame (2D)

In [194]:
dataframe=pd.DataFrame({
    "name":["anil","sunil","reshma"],
    "marks":[91,67,100]
})

In [195]:
dict={
    "name":["anil","sunil","reshma"],
    "marks":[91,67,100]
}

dataframe_1=pd.DataFrame(dict)

In [196]:
data_frame_3=[["anil",91],["sunil",100]]
dataframe_3=pd.DataFrame(data_frame_3,columns=["name","marks"])

In [197]:
dataframe

     name  marks
0    anil     91
1   sunil     67
2  reshma    100

In [198]:
dataframe_1

     name  marks
0    anil     91
1   sunil     67
2  reshma    100

In [199]:
dataframe_3

    name  marks
0   anil     91
1  sunil    100

# 3 Data Import & Export Operations

```python
pd.read_csv('file.csv')
pd.read_excel('file.xlsx')
pd.read_json('file.json')
pd.read_sql(query, connection)
```

In [200]:
student_data=pd.read_csv(r"R:\DATA_ANALYTICS\python\pandas\students.csv")
courses_data=pd.read_csv(r"R:\DATA_ANALYTICS\python\pandas\courses.csv")
enrolment_data=pd.read_csv(r"R:\DATA_ANALYTICS\python\pandas\enrollments.csv")

```python 
df.to_csv('out.csv', index=False)
df.to_excel('out.xlsx')
df.to_json('out.json')
```

```python

# 4 Basic Data Inspection

In [201]:
student_data.head()

   student_id   name   age        department
0           1   Amit  20.0  Computer Science
1           2   Neha  21.0        Mechanical
2           3  Rahul  19.0        Electrical
3           4  Priya  22.0  Computer Science
4           5  Karan   NaN             Civil

In [202]:
student_data.tail()

    student_id     name   age        department
45          46    Rekha  21.0        Electrical
46          47    Lalit  22.0             Civil
47          48    Swati  20.0  Computer Science
48          49  Prakash  21.0               NaN
49          50   Monika  22.0        Mechanical

In [203]:
student_data.shape

(50, 4)

In [204]:
student_data.columns

Index(['student_id', 'name', 'age', 'department'], dtype='object')

In [205]:
student_data.index

RangeIndex(start=0, stop=50, step=1)

In [206]:
student_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  50 non-null     int64
 1   name        50 non-null     object
 2   age         42 non-null     float64
 3   department  47 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 1.7+ KB

In [207]:
student_data.describe()

       student_id        age
count    50.00000  42.000000
mean     25.50000  20.738095
std      14.57738   1.127473
min       1.00000  19.000000
25%      13.25000  20.000000
50%      25.50000  21.000000
75%      37.75000  22.000000
max      50.00000  23.000000

``` python

```python

# 5 Column Operations

SELECT COLUMN

In [208]:
age=student_data['age']

SELECT MULTIPLE COLUMNS

In [209]:
name_age=student_data[['name','age']]

ADD NEW COLUMNS

In [210]:
enrolment_data['passed']=enrolment_data['marks']>80

In [211]:
enrolment_data.head()

  enrollment_id  student_id  course_id  semester  marks        date  passed
0             1         1.0      101.0       1.0   85.0  2024-01-15    True
1             2         1.0      102.0       1.0   78.0  2024-01-15   False
2             3         2.0      201.0       1.0   72.0  2024-01-16   False
3             4         3.0      301.0       1.0   68.0  2024-01-16   False
4             5         4.0      101.0       1.0   91.0  2024-01-17    True

RENAME COLUMN

In [212]:
student_data.rename(columns={"name":"new_name"},inplace=True)

In [213]:
student_data.head()

   student_id new_name   age        department
0           1     Amit  20.0  Computer Science
1           2     Neha  21.0        Mechanical
2           3    Rahul  19.0        Electrical
3           4    Priya  22.0  Computer Science
4           5    Karan   NaN             Civil

DROP column

In [214]:
student_data.drop("new_name",axis=1).head()

   student_id   age        department
0           1  20.0  Computer Science
1           2  21.0        Mechanical
2           3  19.0        Electrical
3           4  22.0  Computer Science
4           5   NaN             Civil

```python

```python

# 6 Row Operations

iloc

In [215]:
student_data.iloc[::].head()

   student_id new_name   age        department
0           1     Amit  20.0  Computer Science
1           2     Neha  21.0        Mechanical
2           3    Rahul  19.0        Electrical
3           4    Priya  22.0  Computer Science
4           5    Karan   NaN             Civil

FILTER DATA

In [216]:
student_data[student_data["age"]>21]

    student_id new_name   age        department
3            4    Priya  22.0  Computer Science
8            9    Rohan  22.0        Electrical
10          11   Vikram  23.0             Civil
14          15   Suresh  22.0             Civil
18          19    Mohan  22.0               NaN
22          23    Nitin  22.0             Civil
26          27   Harish  22.0             Civil
30          31     Ajay  22.0             Civil
34          35     Alok  22.0             Civil
38          39   Girish  22.0             Civil
42          43    Anand  22.0             Civil
46          47    Lalit  22.0             Civil
49          50   Monika  22.0        Mechanical

DROP ROW

In [217]:
student_data.drop(1).head()

   student_id new_name   age        department
0           1     Amit  20.0  Computer Science
2           3    Rahul  19.0        Electrical
3           4    Priya  22.0  Computer Science
4           5    Karan   NaN             Civil
5           6    Sneha  20.0               NaN

 # 8 Sorting Operations

SORT values

In [218]:
student_data.sort_values("age").head(5)

    student_id new_name   age        department
2            3    Rahul  19.0        Electrical
43          44   Shruti  19.0  Computer Science
37          38    Komal  19.0        Electrical
7            8    Pooja  19.0        Mechanical
31          32    Payal  19.0  Computer Science

In [219]:
student_data.sort_values("age",ascending=False).head()

    student_id new_name   age        department
10          11   Vikram  23.0             Civil
49          50   Monika  22.0        Mechanical
30          31     Ajay  22.0             Civil
26          27   Harish  22.0             Civil
3            4    Priya  22.0  Computer Science

# 9 Handling Missing Values

IS NULL , NOTNULL

In [220]:
student_data.isnull().sum()

student_id    0
new_name      0
age           8
department    3
dtype: int64

In [221]:
student_data.notnull().sum()

student_id    50
new_name      50
age           42
department    47
dtype: int64

**dropna**

In [222]:
student_data.dropna().head()

   student_id new_name   age        department
0           1     Amit  20.0  Computer Science
1           2     Neha  21.0        Mechanical
2           3    Rahul  19.0        Electrical
3           4    Priya  22.0  Computer Science
6           7    Arjun  21.0  Computer Science

In [223]:
student_data.dropna(axis=1).head()

   student_id new_name
0           1     Amit
1           2     Neha
2           3    Rahul
3           4    Priya
4           5    Karan

**FILL NA**

In [224]:
student_data.fillna(0).head()

   student_id new_name   age        department
0           1     Amit  20.0  Computer Science
1           2     Neha  21.0        Mechanical
2           3    Rahul  19.0        Electrical
3           4    Priya  22.0  Computer Science
4           5    Karan   0.0             Civil

In [225]:
student_data["age"].fillna(student_data["age"].mode()[0],inplace=True)

C:\Users\layap\AppData\Local\Temp\ipykernel_15008\3102677726.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  student_data["age"].fillna(student_data["age"].mode()[0],inplace=True)

# 10 Data Type Operations

In [226]:
student_data.dtypes

student_id      int64
new_name       object
age           float64
department     object
dtype: object

In [227]:
student_data["age"]=student_data["age"].astype(int)

# Mathematical & Statistical Operations

In [228]:
student_data["age"].max()

23

In [229]:
student_data["age"].min()

19

In [230]:
student_data["age"].count()

50

In [231]:
student_data["age"].mean()

20.94

In [232]:
student_data["age"].median()

21.0

In [233]:
student_data["age"].var()

1.2820408163265307

In [234]:
student_data["age"].std()

1.1322724125962491

fi

# 11 apply ,map , applymap

In [235]:
student_data["age"]=student_data["age"].apply(lambda x : x+5)

In [236]:
student_data["age_grade"]=student_data["age"].map({25:"a",26:"b"})

```python
df.applymap(lambda x: x*2 if type(x)==int else x)
```

# 12 GroupBy Operations

In [237]:
student_data.columns

Index(['student_id', 'new_name', 'age', 'department', 'age_grade'], dtype='object')

In [238]:
student_data.groupby('department')['age'].max()

department
Civil               28
Computer Science    27
Electrical          27
Mechanical          27
Name: age, dtype: int64

In [239]:
student_data.groupby('department').agg({'age':["mean","max"]})

                        age
                       mean max
department
Civil             27.100000  28
Computer Science  25.571429  27
Electrical        25.727273  27
Mechanical        25.583333  27

# 13 Merge, Join & Concat

MERGE

```python # INNER JOIN
inner_join = pd.merge(courses_data, student_data, on='department', how='inner')

# LEFT JOIN
left_join = pd.merge(courses_data, student_data, on='department', how='left')

# RIGHT JOIN
right_join = pd.merge(courses_data, student_data, on='department', how='right')

# OUTER (FULL) JOIN
outer_join = pd.merge(courses_data, student_data, on='department', how='outer')

# CROSS JOIN (no key needed)
cross_join = pd.merge(courses_data, student_data, how='cross')
```

In [240]:
pd.merge(courses_data,student_data,on='department',how='inner')

,course_id,course_name,department,credits,student_id,new_name,age,age_grade
0,101,Python Programming,Computer Science,4.0,1,Amit,25,a
1,101,Python Programming,Computer Science,4.0,4,Priya,27,NaN
2,101,Python Programming,Computer Science,4.0,7,Arjun,26,b
3,101,Python Programming,Computer Science,4.0,10,Anjali,27,NaN
4,101,Python Programming,Computer Science,4.0,12,Nisha,25,a
...,...,...,...,...,...,...,...,...
231,403,Transportation Engineering,Civil,NaN,31,Ajay,27,NaN
232,403,Transportation Engineering,Civil,NaN,35,Alok,27,NaN
233,403,Transportation Engineering,Civil,NaN,39,Girish,27,NaN
234,403,Transportation Engineering,Civil,NaN,43,Anand,27,NaN
235,403,Transportation Engineering,Civil,NaN,47,Lalit,27,NaN

**concat**

In [241]:
pd.concat([student_data,enrolment_data],axis=1).head()

,student_id,new_name,age,department,age_grade,enrollment_id,student_id,course_id,semester,marks,date,passed
0,1.0,Amit,25.0,Computer Science,a,1,1.0,101.0,1.0,85.0,2024-01-15,True
1,2.0,Neha,26.0,Mechanical,b,2,1.0,102.0,1.0,78.0,2024-01-15,False
2,3.0,Rahul,24.0,Electrical,NaN,3,2.0,201.0,1.0,72.0,2024-01-16,False
3,4.0,Priya,27.0,Computer Science,NaN,4,3.0,301.0,1.0,68.0,2024-01-16,False
4,5.0,Karan,27.0,Civil,NaN,5,4.0,101.0,1.0,91.0,2024-01-17,True

**join**

```python
student_data.join(courses_data)
```

# **14 String Operations**

In [242]:
student_data['department'].str.upper().head()

0    COMPUTER SCIENCE
1          MECHANICAL
2          ELECTRICAL
3    COMPUTER SCIENCE
4               CIVIL
Name: department, dtype: object

In [243]:
student_data['department'].str.lower().head()

0    computer science
1          mechanical
2          electrical
3    computer science
4               civil
Name: department, dtype: object

In [244]:
student_data['department'].str.contains('a').head()

0    False
1     True
2     True
3    False
4    False
Name: department, dtype: object

In [245]:
student_data['department'].str.replace('a','b').head()

0    Computer Science
1          Mechbnicbl
2          Electricbl
3    Computer Science
4               Civil
Name: department, dtype: object

# **15 Date & Time Operations**

In [246]:
enrolment_data["date"]=pd.to_datetime(enrolment_data['date'])

In [247]:
enrolment_data["year"]=enrolment_data["date"].dt.year

In [248]:
enrolment_data["month"]=enrolment_data["date"].dt.month

In [249]:
enrolment_data["day"]=enrolment_data["date"].dt.day

In [250]:
enrolment_data.head()

,enrollment_id,student_id,course_id,semester,marks,date,passed,year,month,day
0,1,1.0,101.0,1.0,85.0,2024-01-15,True,2024.0,1.0,15.0
1,2,1.0,102.0,1.0,78.0,2024-01-15,False,2024.0,1.0,15.0
2,3,2.0,201.0,1.0,72.0,2024-01-16,False,2024.0,1.0,16.0
3,4,3.0,301.0,1.0,68.0,2024-01-16,False,2024.0,1.0,16.0
4,5,4.0,101.0,1.0,91.0,2024-01-17,True,2024.0,1.0,17.0

# **16 Duplicate Handling**

In [255]:
courses_data.duplicated().sum()

0

In [254]:
courses_data.drop_duplicates(inplace=True)

In [ ]:
courses_data.drop_duplicates(inplace=True)

In [256]:
courses_data.drop_duplicates(keep="first",inplace=True)